docs/architecture/diagrams/plantuml/structurizr-SystemContext.puml
@startuml
set separator none
title @chrislyons-dev/archlette - System Context

top to bottom direction
skinparam ranksep 60
skinparam nodesep 30

skinparam {
  arrowFontSize 10
  defaultTextAlignment center
  wrapWidth 200
  maxMessageSize 100
}

hide stereotype

skinparam rectangle<<chrislyonsdevarchlette>> {
  BackgroundColor #dddddd
  FontColor #000000
  BorderColor #9a9a9a
  shadowing false
}
skinparam rectangle<<FileSystem>> {
  BackgroundColor #dddddd
  FontColor #000000
  BorderColor #9a9a9a
  shadowing false
}
skinparam rectangle<<FileSystem>> {
  BackgroundColor #dddddd
  FontColor #000000
  BorderColor #9a9a9a
  shadowing false
}
skinparam rectangle<<GithubPlantUMLRepo>> {
  BackgroundColor #dddddd
  FontColor #000000
  BorderColor #9a9a9a
  shadowing false
}
skinparam rectangle<<GithubStructurizrRepo>> {
  BackgroundColor #dddddd
  FontColor #000000
  BorderColor #9a9a9a
  shadowing false
}
skinparam rectangle<<LocalSystemsunziputility>> {
  BackgroundColor #dddddd
  FontColor #000000
  BorderColor #9a9a9a
  shadowing false
}
skinparam rectangle<<User>> {
  BackgroundColor #dddddd
  FontColor #000000
  BorderColor #9a9a9a
  shadowing false
}

rectangle "==User\n<size:10>[Person]</size>\n\nEnd user who runs archlette commands" <<User>> as User
rectangle "==FileSystem\n<size:10>[Software System]</size>\n\nFile system for reading and writing files" <<FileSystem>> as FileSystem
rectangle "==Github Structurizr Repo\n<size:10>[Software System]</size>\n\nThe github repo hosting the Structurizr CLI releases. https://github.com/structurizr/cli/releases/download/v${TOOL_VERSIONS.structurizr}/structurizr-cli.zip" <<GithubStructurizrRepo>> as GithubStructurizrRepo
rectangle "==Github PlantUML Repo\n<size:10>[Software System]</size>\n\nThe github repo hosting the PlantUML CLI releases. https://github.com/plantuml/plantuml/releases/download/v${TOOL_VERSIONS.plantuml}/plantuml-${TOOL_VERSIONS.plantuml}.jar" <<GithubPlantUMLRepo>> as GithubPlantUMLRepo
rectangle "==Local System's unzip utility\n<size:10>[Software System]</size>\n\nThe zip extraction utility on the local system (unzip on Unix, Expand-Archive on Windows)." <<LocalSystemsunziputility>> as LocalSystemsunziputility
rectangle "==File System\n<size:10>[Software System]</size>\n\nThe local file system for caching downloaded tools." <<FileSystem>> as FileSystem
rectangle "==@chrislyons-dev/archlette\n<size:10>[Software System]</size>\n\nArchitecture-as-Code toolkit for automated diagrams, docs, and releases." <<chrislyonsdevarchlette>> as chrislyonsdevarchlette

chrislyonsdevarchlette .[#707070,thickness=2].> FileSystem : "<color:#707070>Uses FileSystem for external system integration"
chrislyonsdevarchlette .[#707070,thickness=2].> GithubStructurizrRepo : "<color:#707070>Uses Github Structurizr Repo for external system integration"
chrislyonsdevarchlette .[#707070,thickness=2].> GithubPlantUMLRepo : "<color:#707070>Uses Github PlantUML Repo for external system integration"
chrislyonsdevarchlette .[#707070,thickness=2].> LocalSystemsunziputility : "<color:#707070>Uses Local System's unzip utility for external system integration"
chrislyonsdevarchlette .[#707070,thickness=2].> FileSystem : "<color:#707070>Uses File System for external system integration"
User .[#707070,thickness=2].> chrislyonsdevarchlette : "<color:#707070>Interacts with CLI"
@enduml
